{
    "endReached":"You have reached the end of this section!",
    "continueToNext":"Continue to the next section:",
    "rememberToCheckPoints":"Remember to check your points from the ball on the bottom-right corner of the material!",
    "footer-src":"Source code of the material",
    "makers":"This course is created by the Agile Education Research -research group",
    "rage":"of the University of Helsinki",
    "credits":"Credits and about the material",
    "twitter-aria":"Mooc.fi Twitter -profile",
    "facebook-aria":"Mooc.fi Facebook -profile",
    "yourube-aria":"Mooc.fi YouTube -channel",
    "logout":"Log out",
    "newAccount":"Create new account",
    "login":"Log in",
    "mailingListTitle":"Remind me when the course starts",
    "subscribe":"subscribe",
    "tableOfContents":"Table of contents",
    "sampleOutput":"Sample output",
    "sampleData":"Sample data",
    "loginToSeeExercise":"Login to view the exercise",
    "pleaseLogin":"You are not logged in. Some parts of the material are only for logged in users. You can log in here: ",
    "inThisSection":"In this part:" ,
    "programmingExercise":"Programming exercise:",
    "moodleExercise": "Moodle exercise:",
    "sqlTrainerExercise": "SQL trainer exercise:",
    "points":"Points",
    "submitNB":"NB! By submitting a solution to a  part of an exercise which has multiple parts, you can get part of the exercise points. You can submit a part by using the 'submit' button on NetBeans. More on the programming exercise submission instructions: ",
    "submitHowTo":"Exercise submission instructions",
    "loginForExercise":"Log in to see the exercise",
    "submitNetBeans":"Submit your solution to be checked on the server on the NetBeans programming environment: ",
    "seeSubmissions":"You can see your submissions in the Test My Code exercise submission environment.",
    "here":"here",
    "solutionHowTo":"How to see the solution",
    "noCoin":"In this exercise you cannot use a coin to see the solution before submitting the exercise.",
    "modelSolutionUnavailableBecauseEmailNotVerified": "Please verify your email address to enable model solutions.",
    "whyCoin":"You can see the solution either before or after submitting the exercise. If you want to see the solution before submitting the exercise you have to use solutioncoins.",
    "getNewCoin":"You will get a new solutioncoin when you have submitted",
    "getNewCoin2":"exercises. You can use coins to see exercise solutions and get yourself out of a pickle.",
    "oneCoin":"You have 1 coin",
    "howManyCoins":"You have <1>{{count}}</1> coins.",
    "nocoins":"You don't have any coins yet.",
    "howCoins":"You only use a coin when you click the button which says 'uses a coin' under this text. You can see the solution without using a coin  in the Test My Code -service  either in Netbeans or in TMC website after submitting the exercise.",
    "seeSolution":"View solution",
    "usesCoin":"Uses a coin",
    "coinUsed":"You have already used a coin for this solution",
    "update":"Update",
    "solution":"Solution",
    "exerciseList":"List of exercises in this part",
    "unknownType":"Unknown exerise type",
    "quiz":"Quiz",
    "loading":"Loading a part...",
    "loginToSee":"There is some content here which is visible only for logged in users. Log in to see the content.",
    "errorInMaterial":"Cannot load a part due to an error: ",
    "incorrectMaterial":"There is some incorrectly defined content here. Reason: no id.",
    "loggedInWith":"You are logged in as: ",
    "studentInfo":"Students information",
    "aboutYourself":"Tell us about yourself. This information helps us to give you the grades and to organize the course. You can edit your information later from the course settings. After filling in your information, press 'Save' at the bottom of the page.",
    "firstName":"First name",
    "lastName":"Last name",
    "sid":"University of Helsinki student number",
    "nosid":"Leave empty if you are not currently a student at the University of Helsinki.",
    "marketing":"You can send me information about new courses",
    "researchTitle":"Research done on this course",
    "research1":"Data from this course is used for research about learning. This research has multiple goals: ",
    "research2":"create adaptable course material, which takes the differences between students into consideration, and when necessary provides more individualized learning materials.",
    "research3":"Increase our knowledge on learning in digital environments, and",
    "research4":"support other parties working with learning materials and learning research. This will naturally lead to better learning outcomes for students as well. ",
    "research5":"If you are interested in this kind of research, called learning analytics, you can learn more from the article ",
    "research6":"The research is led by Matti Luukkainen from the Agile Education Research -group of the Computer Science department of the University of Helsinki. You can request the removal of any data collected about you any time by sending an email to mooc@cs.helsinki.fi",
    "research7":"Data about doing the course is used in research. The collected data contains information about the use of the material, the process used to complete exercises, and data collected from exams. If any research on the data is be published, no individual student can be identified from the results. Not taking part of the research bears no consequences.",
    "researchAgree":"Taking part on the research",
    "researchYes":"I will take part on the research. By selecting this option you will help current and future students.",
    "researchNo":"I will not take part on the research.",
    "save":"Save",
    "fillRequired":"Fill the required fields."

}
